linuxificator/LB_Omnichord/sc_version/esp32p4/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHSIZE_32MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# The fixed shared-reverb banks below the cache window rely on this 128 KiB
# L2 geometry. Firmware contract tests and runtime checks guard the addresses.
CONFIG_CACHE_L2_CACHE_SIZE=0x20000
CONFIG_ESP_SYSTEM_PANIC_PRINT_REBOOT=y
CONFIG_ULP_COPROC_ENABLED=y
CONFIG_ULP_COPROC_TYPE_LP_CORE=y
CONFIG_ULP_COPROC_RESERVE_MEM=24576
CONFIG_ULP_ROM_PRINT_ENABLE=y
CONFIG_ULP_TRAP_WAKEUP=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_HEX=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_CAPS_ALLOC=y
CONFIG_SPIRAM_MEMTEST=y
